OpenAtomFoundation/TobudOS/board/STM8L052R8T6/LIB/inc/stm8l15x_tim5.h
/**
  ******************************************************************************
  * @file    stm8l15x_tim5.h
  * @author  MCD Application Team
  * @version V1.6.1
  * @date    30-September-2014
  * @brief   This file contains all the functions prototypes for the TIM5 firmware
  *          library.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************  
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM8L15x_TIM5_H
#define __STM8L15x_TIM5_H


/* Includes ------------------------------------------------------------------*/
#include "stm8l15x.h"

/** @addtogroup STM8L15x_StdPeriph_Driver
  * @{
  */
  
/** @addtogroup TIM5
  * @{
  */ 
/* Exported types ------------------------------------------------------------*/

/** @defgroup TIM5_Exported_Types
  * @{
  */

/** @defgroup TIM5_Forced_Action
  * @{
  */
typedef enum
{
  TIM5_ForcedAction_Active   = ((uint8_t)0x50),   /*!< Output Reference is forced low */
  TIM5_ForcedAction_Inactive = ((uint8_t)0x40)    /*!< Output Reference is forced high */
}
TIM5_ForcedAction_TypeDef;

#define IS_TIM5_FORCED_ACTION(ACTION) (((ACTION) == TIM5_ForcedAction_Active) || \
                                       ((ACTION) == TIM5_ForcedAction_Inactive))
/**
  * @}
  */
  
/** @defgroup TIM5_Prescaler
  * @{
  */
typedef enum
{
  TIM5_Prescaler_1     = ((uint8_t)0x00),   /*!< Time base Prescaler = 1 (No effect)*/
  TIM5_Prescaler_2     = ((uint8_t)0x01),   /*!< Time base Prescaler = 2 */
  TIM5_Prescaler_4     = ((uint8_t)0x02),   /*!< Time base Prescaler = 4 */
  TIM5_Prescaler_8     = ((uint8_t)0x03),   /*!< Time base Prescaler = 8 */
  TIM5_Prescaler_16    = ((uint8_t)0x04),   /*!< Time base Prescaler = 16 */
  TIM5_Prescaler_32    = ((uint8_t)0x05),   /*!< Time base Prescaler = 32 */
  TIM5_Prescaler_64    = ((uint8_t)0x06),   /*!< Time base Prescaler = 64 */
  TIM5_Prescaler_128   = ((uint8_t)0x07)    /*!< Time base Prescaler = 128 */
}TIM5_Prescaler_TypeDef;

#define IS_TIM5_PRESCALER(PRESCALER) (((PRESCALER) == TIM5_Prescaler_1)  || \
                                      ((PRESCALER) == TIM5_Prescaler_2)  || \
                                      ((PRESCALER) == TIM5_Prescaler_4)  || \
                                      ((PRESCALER) == TIM5_Prescaler_8)  || \
                                      ((PRESCALER) == TIM5_Prescaler_16) || \
                                      ((PRESCALER) == TIM5_Prescaler_32) || \
                                      ((PRESCALER) == TIM5_Prescaler_64) || \
                                      ((PRESCALER) == TIM5_Prescaler_128))
/**
  * @}
  */
  
/** @defgroup TIM5_OCMode
  * @{
  */
typedef enum
{
  TIM5_OCMode_Timing    = ((uint8_t)0x00),   /*!< Timing (Frozen) Mode*/
  TIM5_OCMode_Active    = ((uint8_t)0x10),   /*!< Active Mode*/
  TIM5_OCMode_Inactive  = ((uint8_t)0x20),   /*!< Inactive Mode*/
  TIM5_OCMode_Toggle    = ((uint8_t)0x30),   /*!< Toggle Mode*/
  TIM5_OCMode_PWM1      = ((uint8_t)0x60),   /*!< PWM Mode 1*/
  TIM5_OCMode_PWM2      = ((uint8_t)0x70)    /*!< PWM Mode 2*/
}TIM5_OCMode_TypeDef;

#define IS_TIM5_OC_MODE(MODE) (((MODE) ==  TIM5_OCMode_Timing)  || \
                               ((MODE) == TIM5_OCMode_Active)   || \
                               ((MODE) == TIM5_OCMode_Inactive) || \
                               ((MODE) == TIM5_OCMode_Toggle)   || \
                               ((MODE) == TIM5_OCMode_PWM1)     || \
                               ((MODE) == TIM5_OCMode_PWM2))

#define IS_TIM5_OCM(MODE) (((MODE) ==  TIM5_OCMode_Timing)  || \
                           ((MODE) == TIM5_OCMode_Active)   || \
                           ((MODE) == TIM5_OCMode_Inactive) || \
                           ((MODE) == TIM5_OCMode_Toggle)   || \
                           ((MODE) == TIM5_OCMode_PWM1)     || \
                           ((MODE) == TIM5_OCMode_PWM2)     || \
                           ((MODE) == (uint8_t)TIM5_ForcedAction_Active) || \
                           ((MODE) == (uint8_t)TIM5_ForcedAction_Inactive))
/**
  * @}
  */
  
/** @defgroup TIM5_OnePulseMode
  * @{
  */
typedef enum
{
  TIM5_OPMode_Single      = ((uint8_t)0x01), /*!< Single one Pulse mode (OPM Active) */
  TIM5_OPMode_Repetitive  = ((uint8_t)0x00)  /*!< Repetitive Pulse mode (OPM inactive) */
}TIM5_OPMode_TypeDef;

#define IS_TIM5_OPM_MODE(MODE) (((MODE) == TIM5_OPMode_Single) || \
                                ((MODE) == TIM5_OPMode_Repetitive))
/**
  * @}
  */
  
/** @defgroup TIM5_Channel
  * @{
  */
typedef enum
{
  TIM5_Channel_1  = ((uint8_t)0x00),  /*!< Channel 1*/
  TIM5_Channel_2  = ((uint8_t)0x01)   /*!< Channel 2*/
}TIM5_Channel_TypeDef;

#define IS_TIM5_CHANNEL(CHANNEL) (((CHANNEL) == TIM5_Channel_1) || \
                                  ((CHANNEL) == TIM5_Channel_2) )
/**
  * @}
  */
  
/** @defgroup TIM5_CounterMode
  * @{
  */
typedef enum
{
  TIM5_CounterMode_Up               = ((uint8_t)0x00),   /*!< Counter Up Mode */
  TIM5_CounterMode_Down             = ((uint8_t)0x10),   /*!< Counter Down Mode */
  TIM5_CounterMode_CenterAligned1   = ((uint8_t)0x20),   /*!< Counter Central aligned Mode 1 */
  TIM5_CounterMode_CenterAligned2   = ((uint8_t)0x40),   /*!< Counter Central aligned Mode 2 */
  TIM5_CounterMode_CenterAligned3   = ((uint8_t)0x60)    /*!< Counter Central aligned Mode 3 */
}TIM5_CounterMode_TypeDef;

#define IS_TIM5_COUNTER_MODE(MODE) (((MODE) == TIM5_CounterMode_Up)   || \
                                    ((MODE) == TIM5_CounterMode_Down) || \
                                    ((MODE) == TIM5_CounterMode_CenterAligned1) || \
                                    ((MODE) == TIM5_CounterMode_CenterAligned2) || \
                                    ((MODE) == TIM5_CounterMode_CenterAligned3))
/**
  * @}
  */
  
/** @defgroup TIM5_Output_Compare_Polarity
  * @{
  */
typedef enum
{
  TIM5_OCPolarity_High   = ((uint8_t)0x00),   /*!< Output compare polarity  = High */
  TIM5_OCPolarity_Low    = ((uint8_t)0x01)    /*!< Output compare polarity  = Low */
}TIM5_OCPolarity_TypeDef;

#define IS_TIM5_OC_POLARITY(POLARITY) (((POLARITY) == TIM5_OCPolarity_High) || \
                                       ((POLARITY) == TIM5_OCPolarity_Low))
/**
  * @}
  */
  
